{
    "metadata": {
        "total_size": 20391405152
    },
    "weight_map": {
        "language_model.lm_head.biases": "model-00004-of-00004.safetensors",
        "language_model.lm_head.scales": "model-00004-of-00004.safetensors",
        "language_model.lm_head.weight": "model-00004-of-00004.safetensors",
        "language_model.model.embed_tokens.biases": "model-00001-of-00004.safetensors",
        "language_model.model.embed_tokens.scales": "model-00001-of-00004.safetensors",
        "language_model.model.embed_tokens.weight": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.input_layernorm.weight": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.linear_attn.A_log": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.linear_attn.conv1d.weight": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.linear_attn.dt_bias": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.linear_attn.in_proj_a.biases": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.linear_attn.in_proj_a.scales": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.linear_attn.in_proj_a.weight": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.linear_attn.in_proj_b.biases": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.linear_attn.in_proj_b.scales": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.linear_attn.in_proj_b.weight": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.linear_attn.in_proj_qkv.biases": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.linear_attn.in_proj_qkv.scales": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.linear_attn.in_proj_qkv.weight": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.linear_attn.in_proj_z.biases": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.linear_attn.in_proj_z.scales": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.linear_attn.in_proj_z.weight": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.linear_attn.norm.weight": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.linear_attn.out_proj.biases": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.linear_attn.out_proj.scales": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.linear_attn.out_proj.weight": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.mlp.gate.biases": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.mlp.gate.scales": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.mlp.gate.weight": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.mlp.shared_expert.down_proj.biases": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.mlp.shared_expert.down_proj.scales": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.mlp.shared_expert.down_proj.weight": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.mlp.shared_expert.gate_proj.biases": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.mlp.shared_expert.gate_proj.scales": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.mlp.shared_expert.gate_proj.weight": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.mlp.shared_expert.up_proj.biases": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.mlp.shared_expert.up_proj.scales": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.mlp.shared_expert.up_proj.weight": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.mlp.shared_expert_gate.biases": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.mlp.shared_expert_gate.scales": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.mlp.shared_expert_gate.weight": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.mlp.switch_mlp.down_proj.biases": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.mlp.switch_mlp.down_proj.scales": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.mlp.switch_mlp.down_proj.weight": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.mlp.switch_mlp.gate_proj.biases": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.mlp.switch_mlp.gate_proj.scales": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.mlp.switch_mlp.gate_proj.weight": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.mlp.switch_mlp.up_proj.biases": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.mlp.switch_mlp.up_proj.scales": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.mlp.switch_mlp.up_proj.weight": "model-00001-of-00004.safetensors",
        "language_model.model.layers.0.post_attention_layernorm.weight": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.input_layernorm.weight": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.linear_attn.A_log": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.linear_attn.conv1d.weight": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.linear_attn.dt_bias": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.linear_attn.in_proj_a.biases": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.linear_attn.in_proj_a.scales": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.linear_attn.in_proj_a.weight": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.linear_attn.in_proj_b.biases": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.linear_attn.in_proj_b.scales": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.linear_attn.in_proj_b.weight": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.linear_attn.in_proj_qkv.biases": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.linear_attn.in_proj_qkv.scales": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.linear_attn.in_proj_qkv.weight": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.linear_attn.in_proj_z.biases": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.linear_attn.in_proj_z.scales": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.linear_attn.in_proj_z.weight": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.linear_attn.norm.weight": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.linear_attn.out_proj.biases": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.linear_attn.out_proj.scales": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.linear_attn.out_proj.weight": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.mlp.gate.biases": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.mlp.gate.scales": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.mlp.gate.weight": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.mlp.shared_expert.down_proj.biases": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.mlp.shared_expert.down_proj.scales": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.mlp.shared_expert.down_proj.weight": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.mlp.shared_expert.gate_proj.biases": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.mlp.shared_expert.gate_proj.scales": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.mlp.shared_expert.gate_proj.weight": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.mlp.shared_expert.up_proj.biases": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.mlp.shared_expert.up_proj.scales": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.mlp.shared_expert.up_proj.weight": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.mlp.shared_expert_gate.biases": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.mlp.shared_expert_gate.scales": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.mlp.shared_expert_gate.weight": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.mlp.switch_mlp.down_proj.biases": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.mlp.switch_mlp.down_proj.scales": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.mlp.switch_mlp.down_proj.weight": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.mlp.switch_mlp.gate_proj.biases": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.mlp.switch_mlp.gate_proj.scales": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.mlp.switch_mlp.gate_proj.weight": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.mlp.switch_mlp.up_proj.biases": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.mlp.switch_mlp.up_proj.scales": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.mlp.switch_mlp.up_proj.weight": "model-00001-of-00004.safetensors",
        "language_model.model.layers.1.post_attention_layernorm.weight": "model-00001-of-00004.safetensors",
        "language_model.model.layers.10.input_layernorm.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.linear_attn.A_log": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.linear_attn.conv1d.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.linear_attn.dt_bias": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.linear_attn.in_proj_a.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.linear_attn.in_proj_a.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.linear_attn.in_proj_a.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.linear_attn.in_proj_b.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.linear_attn.in_proj_b.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.linear_attn.in_proj_b.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.linear_attn.in_proj_qkv.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.linear_attn.in_proj_qkv.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.linear_attn.in_proj_qkv.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.linear_attn.in_proj_z.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.linear_attn.in_proj_z.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.linear_attn.in_proj_z.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.linear_attn.norm.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.linear_attn.out_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.linear_attn.out_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.linear_attn.out_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.mlp.gate.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.mlp.gate.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.mlp.gate.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.mlp.shared_expert.down_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.mlp.shared_expert.down_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.mlp.shared_expert.down_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.mlp.shared_expert.gate_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.mlp.shared_expert.gate_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.mlp.shared_expert.gate_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.mlp.shared_expert.up_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.mlp.shared_expert.up_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.mlp.shared_expert.up_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.mlp.shared_expert_gate.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.mlp.shared_expert_gate.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.mlp.shared_expert_gate.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.mlp.switch_mlp.down_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.mlp.switch_mlp.down_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.mlp.switch_mlp.down_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.mlp.switch_mlp.gate_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.mlp.switch_mlp.gate_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.mlp.switch_mlp.gate_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.mlp.switch_mlp.up_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.mlp.switch_mlp.up_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.mlp.switch_mlp.up_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.10.post_attention_layernorm.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.11.input_layernorm.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.11.mlp.gate.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.11.mlp.gate.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.11.mlp.gate.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.11.mlp.shared_expert.down_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.11.mlp.shared_expert.down_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.11.mlp.shared_expert.down_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.11.mlp.shared_expert.gate_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.11.mlp.shared_expert.gate_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.11.mlp.shared_expert.gate_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.11.mlp.shared_expert.up_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.11.mlp.shared_expert.up_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.11.mlp.shared_expert.up_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.11.mlp.shared_expert_gate.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.11.mlp.shared_expert_gate.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.11.mlp.shared_expert_gate.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.11.mlp.switch_mlp.down_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.11.mlp.switch_mlp.down_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.11.mlp.switch_mlp.down_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.11.mlp.switch_mlp.gate_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.11.mlp.switch_mlp.gate_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.11.mlp.switch_mlp.gate_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.11.mlp.switch_mlp.up_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.11.mlp.switch_mlp.up_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.11.mlp.switch_mlp.up_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.11.post_attention_layernorm.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.11.self_attn.k_norm.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.11.self_attn.k_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.11.self_attn.k_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.11.self_attn.k_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.11.self_attn.o_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.11.self_attn.o_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.11.self_attn.o_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.11.self_attn.q_norm.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.11.self_attn.q_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.11.self_attn.q_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.11.self_attn.q_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.11.self_attn.v_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.11.self_attn.v_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.11.self_attn.v_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.input_layernorm.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.linear_attn.A_log": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.linear_attn.conv1d.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.linear_attn.dt_bias": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.linear_attn.in_proj_a.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.linear_attn.in_proj_a.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.linear_attn.in_proj_a.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.linear_attn.in_proj_b.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.linear_attn.in_proj_b.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.linear_attn.in_proj_b.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.linear_attn.in_proj_qkv.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.linear_attn.in_proj_qkv.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.linear_attn.in_proj_qkv.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.linear_attn.in_proj_z.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.linear_attn.in_proj_z.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.linear_attn.in_proj_z.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.linear_attn.norm.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.linear_attn.out_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.linear_attn.out_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.linear_attn.out_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.mlp.gate.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.mlp.gate.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.mlp.gate.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.mlp.shared_expert.down_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.mlp.shared_expert.down_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.mlp.shared_expert.down_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.mlp.shared_expert.gate_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.mlp.shared_expert.gate_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.mlp.shared_expert.gate_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.mlp.shared_expert.up_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.mlp.shared_expert.up_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.mlp.shared_expert.up_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.mlp.shared_expert_gate.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.mlp.shared_expert_gate.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.mlp.shared_expert_gate.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.mlp.switch_mlp.down_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.mlp.switch_mlp.down_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.mlp.switch_mlp.down_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.mlp.switch_mlp.gate_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.mlp.switch_mlp.gate_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.mlp.switch_mlp.gate_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.mlp.switch_mlp.up_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.mlp.switch_mlp.up_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.mlp.switch_mlp.up_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.12.post_attention_layernorm.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.input_layernorm.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.linear_attn.A_log": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.linear_attn.conv1d.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.linear_attn.dt_bias": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.linear_attn.in_proj_a.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.linear_attn.in_proj_a.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.linear_attn.in_proj_a.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.linear_attn.in_proj_b.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.linear_attn.in_proj_b.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.linear_attn.in_proj_b.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.linear_attn.in_proj_qkv.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.linear_attn.in_proj_qkv.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.linear_attn.in_proj_qkv.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.linear_attn.in_proj_z.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.linear_attn.in_proj_z.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.linear_attn.in_proj_z.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.linear_attn.norm.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.linear_attn.out_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.linear_attn.out_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.linear_attn.out_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.mlp.gate.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.mlp.gate.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.mlp.gate.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.mlp.shared_expert.down_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.mlp.shared_expert.down_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.mlp.shared_expert.down_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.mlp.shared_expert.gate_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.mlp.shared_expert.gate_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.mlp.shared_expert.gate_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.mlp.shared_expert.up_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.mlp.shared_expert.up_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.mlp.shared_expert.up_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.mlp.shared_expert_gate.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.mlp.shared_expert_gate.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.mlp.shared_expert_gate.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.mlp.switch_mlp.down_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.mlp.switch_mlp.down_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.mlp.switch_mlp.down_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.mlp.switch_mlp.gate_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.mlp.switch_mlp.gate_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.mlp.switch_mlp.gate_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.mlp.switch_mlp.up_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.mlp.switch_mlp.up_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.mlp.switch_mlp.up_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.13.post_attention_layernorm.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.input_layernorm.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.linear_attn.A_log": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.linear_attn.conv1d.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.linear_attn.dt_bias": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.linear_attn.in_proj_a.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.linear_attn.in_proj_a.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.linear_attn.in_proj_a.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.linear_attn.in_proj_b.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.linear_attn.in_proj_b.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.linear_attn.in_proj_b.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.linear_attn.in_proj_qkv.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.linear_attn.in_proj_qkv.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.linear_attn.in_proj_qkv.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.linear_attn.in_proj_z.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.linear_attn.in_proj_z.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.linear_attn.in_proj_z.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.linear_attn.norm.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.linear_attn.out_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.linear_attn.out_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.linear_attn.out_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.mlp.gate.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.mlp.gate.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.mlp.gate.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.mlp.shared_expert.down_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.mlp.shared_expert.down_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.mlp.shared_expert.down_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.mlp.shared_expert.gate_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.mlp.shared_expert.gate_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.mlp.shared_expert.gate_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.mlp.shared_expert.up_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.mlp.shared_expert.up_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.mlp.shared_expert.up_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.mlp.shared_expert_gate.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.mlp.shared_expert_gate.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.mlp.shared_expert_gate.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.mlp.switch_mlp.down_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.mlp.switch_mlp.down_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.mlp.switch_mlp.down_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.mlp.switch_mlp.gate_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.mlp.switch_mlp.gate_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.mlp.switch_mlp.gate_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.mlp.switch_mlp.up_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.mlp.switch_mlp.up_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.mlp.switch_mlp.up_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.14.post_attention_layernorm.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.15.input_layernorm.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.15.mlp.gate.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.15.mlp.gate.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.15.mlp.gate.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.15.mlp.shared_expert.down_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.15.mlp.shared_expert.down_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.15.mlp.shared_expert.down_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.15.mlp.shared_expert.gate_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.15.mlp.shared_expert.gate_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.15.mlp.shared_expert.gate_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.15.mlp.shared_expert.up_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.15.mlp.shared_expert.up_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.15.mlp.shared_expert.up_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.15.mlp.shared_expert_gate.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.15.mlp.shared_expert_gate.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.15.mlp.shared_expert_gate.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.15.mlp.switch_mlp.down_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.15.mlp.switch_mlp.down_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.15.mlp.switch_mlp.down_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.15.mlp.switch_mlp.gate_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.15.mlp.switch_mlp.gate_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.15.mlp.switch_mlp.gate_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.15.mlp.switch_mlp.up_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.15.mlp.switch_mlp.up_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.15.mlp.switch_mlp.up_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.15.post_attention_layernorm.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.15.self_attn.k_norm.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.15.self_attn.k_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.15.self_attn.k_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.15.self_attn.k_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.15.self_attn.o_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.15.self_attn.o_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.15.self_attn.o_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.15.self_attn.q_norm.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.15.self_attn.q_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.15.self_attn.q_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.15.self_attn.q_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.15.self_attn.v_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.15.self_attn.v_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.15.self_attn.v_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.input_layernorm.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.linear_attn.A_log": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.linear_attn.conv1d.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.linear_attn.dt_bias": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.linear_attn.in_proj_a.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.linear_attn.in_proj_a.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.linear_attn.in_proj_a.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.linear_attn.in_proj_b.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.linear_attn.in_proj_b.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.linear_attn.in_proj_b.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.linear_attn.in_proj_qkv.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.linear_attn.in_proj_qkv.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.linear_attn.in_proj_qkv.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.linear_attn.in_proj_z.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.linear_attn.in_proj_z.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.linear_attn.in_proj_z.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.linear_attn.norm.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.linear_attn.out_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.linear_attn.out_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.linear_attn.out_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.mlp.gate.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.mlp.gate.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.mlp.gate.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.mlp.shared_expert.down_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.mlp.shared_expert.down_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.mlp.shared_expert.down_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.mlp.shared_expert.gate_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.mlp.shared_expert.gate_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.mlp.shared_expert.gate_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.mlp.shared_expert.up_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.mlp.shared_expert.up_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.mlp.shared_expert.up_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.mlp.shared_expert_gate.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.mlp.shared_expert_gate.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.mlp.shared_expert_gate.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.mlp.switch_mlp.down_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.mlp.switch_mlp.down_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.mlp.switch_mlp.down_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.mlp.switch_mlp.gate_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.mlp.switch_mlp.gate_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.mlp.switch_mlp.gate_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.mlp.switch_mlp.up_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.mlp.switch_mlp.up_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.mlp.switch_mlp.up_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.16.post_attention_layernorm.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.input_layernorm.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.linear_attn.A_log": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.linear_attn.conv1d.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.linear_attn.dt_bias": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.linear_attn.in_proj_a.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.linear_attn.in_proj_a.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.linear_attn.in_proj_a.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.linear_attn.in_proj_b.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.linear_attn.in_proj_b.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.linear_attn.in_proj_b.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.linear_attn.in_proj_qkv.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.linear_attn.in_proj_qkv.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.linear_attn.in_proj_qkv.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.linear_attn.in_proj_z.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.linear_attn.in_proj_z.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.linear_attn.in_proj_z.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.linear_attn.norm.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.linear_attn.out_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.linear_attn.out_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.linear_attn.out_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.mlp.gate.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.mlp.gate.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.mlp.gate.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.mlp.shared_expert.down_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.mlp.shared_expert.down_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.mlp.shared_expert.down_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.mlp.shared_expert.gate_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.mlp.shared_expert.gate_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.mlp.shared_expert.gate_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.mlp.shared_expert.up_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.mlp.shared_expert.up_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.mlp.shared_expert.up_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.mlp.shared_expert_gate.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.mlp.shared_expert_gate.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.mlp.shared_expert_gate.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.mlp.switch_mlp.down_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.mlp.switch_mlp.down_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.mlp.switch_mlp.down_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.mlp.switch_mlp.gate_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.mlp.switch_mlp.gate_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.mlp.switch_mlp.gate_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.mlp.switch_mlp.up_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.mlp.switch_mlp.up_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.mlp.switch_mlp.up_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.17.post_attention_layernorm.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.18.input_layernorm.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.18.linear_attn.A_log": "model-00002-of-00004.safetensors",
        "language_model.model.layers.18.linear_attn.conv1d.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.18.linear_attn.dt_bias": "model-00002-of-00004.safetensors",
        "language_model.model.layers.18.linear_attn.in_proj_a.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.18.linear_attn.in_proj_a.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.18.linear_attn.in_proj_a.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.18.linear_attn.in_proj_b.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.18.linear_attn.in_proj_b.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.18.linear_attn.in_proj_b.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.18.linear_attn.in_proj_qkv.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.18.linear_attn.in_proj_qkv.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.18.linear_attn.in_proj_qkv.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.18.linear_attn.in_proj_z.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.18.linear_attn.in_proj_z.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.18.linear_attn.in_proj_z.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.18.linear_attn.norm.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.18.linear_attn.out_proj.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.18.linear_attn.out_proj.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.18.linear_attn.out_proj.weight": "model-00002-of-00004.safetensors",
        "language_model.model.layers.18.mlp.gate.biases": "model-00002-of-00004.safetensors",
        "language_model.model.layers.18.mlp.gate.scales": "model-00002-of-00004.safetensors",
        "language_model.model.layers.18.mlp.gate.weight": "model-00002-of-00004.safetensors",
